Revit 2024 API
BuiltInFailures.EditingFailures.CannotScaleInView Property
 Can't scale because Move Plane is at a very sharp angle in this view. Change view angle or go to another view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotScaleInView { get; }
Visual Basic
Public Shared ReadOnly Property CannotScaleInView As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotScaleInView {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace